vernonet/ESP32_PRJ/esp32_wifi_microphone_async/src/main.cpp
#if !(defined(ESP32) )
  #error This code is intended to run on the ESP32 platform! Please check your Tools->Board setting.
#endif
#include <esp_wifi.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <esp_arduino_version.h>
#define USE_AVAILABLE_PAGES     true
#include "I2SMEMSSampler.h"
#include <ESPmDNS.h>
#include <NTPClient.h>
#include <driver/i2s.h>
#include "main.h"
#include <Update.h>
#include "soc/timer_group_struct.h"
#include "soc/timer_group_reg.h"
#include <ArduinoJson.h> 
#include <AsyncTCP.h>
#include <ESPAsync_WiFiManager.h>               //https://github.com/khoih-prog/ESPAsync_WiFiManager
#include <ESPAsync_WiFiManager-Impl.h>          //https://github.com/khoih-prog/ESPAsync_WiFiManager#howto-fix-multiple-definitions-linker-error
#include "AudioTools.h"
#include "AudioTools/Buffers.h"
#include "AudioTools/AudioStreams.h"
#if !( USING_ESP32_S2 || USING_ESP32_C3 )
  DNSServer dnsServer;
#endif 
#include "esp32/rom/rtc.h"

#include "FS.h"
#include <LittleFS.h>
FS* filesystem =      &LittleFS;
#define FileFS        LittleFS
#define FS_Name       "LittleFS"
const char* CONFIG_FILE = "/ConfigSW.json";



extern "C" {
uint8_t temprature_sens_read();
}

// I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S
// SPH0645, INMP441 MEMS MICROPHONE
//insert in vlc  "http://wifi-mic.local:8080/rec.wav" or "http://<user>:<pass>@wifi-mic.local:8080/rec.wav" or "http://ip:8080/rec.wav"   ip - ip address of mic
//for ota update  http://wifi-mic.local:8080/upd_frm 
//for info        http://wifi-mic.local:8080/info

//#define NO_WIFI                  //testing the microphone using the "serial_audio.exe" program.

#define SAMPLE_BUFFER_SIZE         512    //Length of one buffer, in 32-bit words.  //512 //300  
#define BUF_CNT                    16      // Number of buffers in the I2S circular buffer   
#define SAMPLE_RATE                22050  //22050 //33000  //16000
#define BITS_PER_SAMPLE            (16)   // 16, maybe 24  
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(2, 0, 4)
  #define I2S_MIC_CHANNEL            I2S_CHANNEL_FMT_ONLY_RIGHT // most microphones will probably default to left channel but you may need to tie the L/R pin low
#else
  #define I2S_MIC_CHANNEL            I2S_CHANNEL_FMT_ONLY_LEFT
#endif  
#if (0)
  //esp32a1s
  #define I2S_MIC_SERIAL_CLOCK       GPIO_NUM_18
  #define I2S_MIC_LEFT_RIGHT_CLOCK   GPIO_NUM_5
  #define I2S_MIC_SERIAL_DATA        GPIO_NUM_23
  #define LED_ON                     LOW
  #define LED_OFF                    HIGH
  #define PIN_LED                    GPIO_NUM_22
  const int TRIGGER_PIN3 = GPIO_NUM_13;      // short  contact to ground to enter config portal
#else
  //esp32dev
  #define I2S_MIC_SERIAL_CLOCK       GPIO_NUM_32
  #define I2S_MIC_LEFT_RIGHT_CLOCK   GPIO_NUM_25
  #define I2S_MIC_SERIAL_DATA        GPIO_NUM_33
  #define LED_ON                     HIGH
  #define LED_OFF                    LOW
  #define PIN_LED                    GPIO_NUM_22
  const int TRIGGER_PIN3 = GPIO_NUM_2;      // short  contact to ground to enter config portal
#endif

#define SERVER_PORT                "8080"
#define BAUDRATE                   (BAUDRATE_)
#define SIGNAL_GAIN                (0)// 0 - max gain, 2 - no gain
#define REC_TIME                   (6000) //sec
#define NUM_CPY                    ((SAMPLE_RATE * BITS_PER_SAMPLE / 8 * REC_TIME)/SAMPLE_BUFFER_SIZE)//
#define USER_OTA                   "admin"
#define PASS_OTA                   "admin"
#define PASS_CONF_PORTAL           "testtest"
#define LOG_SIZE                   (0x4000)

#define SEND_BLOCK_SIZE_MAX        (2048)
#define SEND_BLOCK_SIZE_MIN        (2048)  //1024

#define WIFI_CONNECT_TIMEOUT      30000L
#define WHILE_LOOP_DELAY          200L
#define WHILE_LOOP_STEPS          (WIFI_CONNECT_TIMEOUT / ( 3 * WHILE_LOOP_DELAY ))

// Use USE_DHCP_IP == true for dynamic DHCP IP, false to use static IP which you have to change accordingly to your network
#if (defined(USE_STATIC_IP_CONFIG_IN_CP) && !USE_STATIC_IP_CONFIG_IN_CP)
  // Force DHCP to be true
  #if defined(USE_DHCP_IP)
    #undef USE_DHCP_IP
  #endif
  #define USE_DHCP_IP     true
#else
  // You can select DHCP or Static IP here
  #define USE_DHCP_IP     true
#endif


#define reverse_bytes(value)        ((value & 0x000000FFU) << 24 | (value & 0x0000FF00U) << 8 |(value & 0x00FF0000U) >> 8 | (value & 0xFF000000U) >> 24)
#define reverse_halfword(value)     ((value & 0x00FFU) << 24 |  (value & 0xFF000000U) >> 24)
#define reverse_sample16(value)     (((value >> 8)&0xFF) | ((value << 8)&0xFF00))

#define param_info(str, nme, value)   str +=F("<tr><td>");\
                                      str +=F(nme);\
                                      str +=F("</td><td>");\
                                      str += value;\
                                      str += F("</td></tr>");

#ifdef ARDUINO_ESP32_RELEASE_1_0_6 
  #define ESP_getChipId()   (ESP.getChipId())
#endif 

const i2s_port_t I2S_PORT = I2S_NUM_0;
uint8_t signal_gain = SIGNAL_GAIN;
volatile uint32_t wait_reset = 0;
uint32_t temp_buf_f[44/4]; //for header
String ssid = "wifi_mic_ap";
const char* password = PASS_CONF_PORTAL;     //password for config portal
// SSID and PW for your Router
String Router_SSID;
String Router_Pass;
volatile bool con_flag = false, start_rec = false, starting = true;
volatile unsigned int tme = 0;
uint32_t send_count;
WiFi_STA_IPConfig  WM_STA_IPconfig_;
const char compile_date[] = __DATE__ " " __TIME__;
bool authenticate=false;
char temp_[6];
char date_[11];
String log_page;
__NOINIT_ATTR char log_str[100];
uint32_t free_mem8 = 0, free_mem32 = 0;

using namespace audio_tools;
RingBufferStream wav_stream(SAMPLE_BUFFER_SIZE*96);
//RingBuffer<uint8_t> wav_stream(SAMPLE_BUFFER_SIZE*64); 
int16_t samples[SAMPLE_BUFFER_SIZE*(BITS_PER_SAMPLE>>3)*2];
bool stream_active = false;
bool blk_sze_changed = false;
uint32_t aviable;
extern bool client_connected;

AsyncClient *client_ = nullptr;
AsyncWebServer * server;
AsyncWebServer * webServer_async;
TaskHandle_t i2sMemsToBuffTaskHandle;
SemaphoreHandle_t mutex_wav_stream;

//flag to use from web update to reboot the ESP
bool shouldReboot = false;

// Define NTP Client to get time
const long utcOffsetInSeconds = 2 * 60 * 60; //+2;
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", utcOffsetInSeconds);
char m_login[12], m_pass[12], m_port[8];

void launchWeb(int webtype);
void i2sMemsToBuffTask(void *param);
void i2sMemsToUartTask(void *param);
void handleNotFound(AsyncWebServerRequest *request);
void handle_rec_wav(AsyncWebServerRequest *request); 
void handle_update(AsyncWebServerRequest *request);
void handle_upload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final);
void handle_upd_frm(AsyncWebServerRequest *request);
void handle_log(AsyncWebServerRequest *request);
void handle_info(AsyncWebServerRequest *request);
//void handle_scan(AsyncWebServerRequest *request);
//void handle_restart(AsyncWebServerRequest *request);
//void onWsEvent(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len);
bool writeConfigFile(void);
bool readConfigFile(void);
bool mount_fs(void);
const char * reset_reson_str(esp_reset_reason_t val);
String ESP32GetResetReason(uint32_t cpu_no);


