vernonet/ESP32_PRJ/esp32_wifi_microphone_async/src/main.cpp
I2SSampler *i2sSampler = NULL;
i2s_config_t i2s_config = {
  .mode = i2s_mode_t(I2S_MODE_MASTER | I2S_MODE_RX), // Receive, not transfer
  .sample_rate = SAMPLE_RATE,
  .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT, // could only get it to work with 32bits
  .channel_format = I2S_MIC_CHANNEL, // although the SEL config should be left, it seems to transmit on right
#ifdef ARDUINO_ESP32_RELEASE_1_0_6  
  .communication_format = i2s_comm_format_t(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB),
#else  // 2.00.....
  .communication_format = i2s_comm_format_t(I2S_COMM_FORMAT_STAND_I2S),
#endif
  .intr_alloc_flags = (ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_SHARED),        // Interrupt level 1
  .dma_buf_count = BUF_CNT,                        // number of buffers
  .dma_buf_len = SAMPLE_BUFFER_SIZE,               // samples per buffer
 // .use_apll = true,
  .tx_desc_auto_clear = true
};
// The pin config as per the setup
i2s_pin_config_t i2s_mic_pins = {
  .bck_io_num = I2S_MIC_SERIAL_CLOCK,
  .ws_io_num = I2S_MIC_LEFT_RIGHT_CLOCK,
  .data_out_num = I2S_PIN_NO_CHANGE,
  .data_in_num = I2S_MIC_SERIAL_DATA
};




void setup(void) {

  log_page.reserve(LOG_SIZE);
#if (BITS_PER_SAMPLE != 16 && BITS_PER_SAMPLE != 24)
  #error "This BITS_PER_SAMPLE not suported!!!!"
#endif  

  pinMode(TRIGGER_PIN3, INPUT_PULLUP);   //to enter config portal
  pinMode(PIN_LED, OUTPUT);  
  digitalWrite(PIN_LED, LED_OFF);   

#ifdef NO_WIFI
  WiFi.mode(WIFI_OFF);
#endif
  delay(500);
  Serial.begin(BAUDRATE);
  Serial.print("\r\nStarting...\r\ncompile date: ");
  Serial.println(compile_date);
  if (strncmp(log_str, "Last client", 11) == 0) // If the last client caused a restart  ESP32.
    Serial.println(log_str);
  if (!mount_fs() || !readConfigFile())
  {
    Serial.println(F("Failed to read ConfigFile, using default values"));
    strcpy(m_login, USER_OTA);
    strcpy(m_pass, PASS_OTA);
    strcpy(m_port, SERVER_PORT);
  }
#ifndef NO_WIFI
   unsigned long startedAt = millis();
   webServer_async = new AsyncWebServer(80);
#if ( USING_ESP32_S2 || USING_ESP32_C3 )
 ESPAsync_WiFiManager ESPAsync_wifiManager(webServer_async, NULL, "wifi-mic");
#else
 ESPAsync_WiFiManager ESPAsync_wifiManager(webServer_async, &dnsServer, "wifi-mic");
#endif  
  ESPAsync_wifiManager.setMinimumSignalQuality(-1);
  // Set static IP, Gateway, Subnetmask, DNS1 and DNS2. New in v1.0.5
  // ESP_wifiManager.setSTAStaticIPConfig(IPAddress(192,168,2,114), IPAddress(192,168,2,1), IPAddress(255,255,255,0), IPAddress(192,168,2,1), IPAddress(8,8,8,8));
  // Have to create a new function to store in EEPROM/SPIFFS for this purpose
  Router_SSID = ESPAsync_wifiManager.WiFi_SSID();
  Router_Pass = ESPAsync_wifiManager.WiFi_Pass();  
  //ESP_wifiManager.getSTAStaticIPConfig(WM_STA_IPconfig_);
  //Remove this line if you do not want to see WiFi password printed
  Serial.println("Stored: SSID = " + Router_SSID + ", Pass = " + Router_Pass);
  // SSID to uppercase
  ssid.toUpperCase();
  if (Router_SSID == "")
  {
    Serial.println("We haven't got any access point credentials, so get them now");
    Serial.println("It is necessary to wait a bit until the WIFI-MIC access point appears");
    Serial.println("Starting configuration portal: AP SSID = " + ssid + ", Pass = " + password );
    digitalWrite(PIN_LED, LED_ON); // Turn led on as we are in configuration mode.
    
    ESPAsync_WMParameter p_m_login("mic_login", "mic Login", USER_OTA, 12);  
    ESPAsync_WMParameter p_m_pass("mic_pass", "mic password", PASS_OTA, 12);
    ESPAsync_WMParameter p_m_port("mic_port", "server port", SERVER_PORT, 8);

    ESPAsync_wifiManager.addParameter(&p_m_login);
    ESPAsync_wifiManager.addParameter(&p_m_pass);
    ESPAsync_wifiManager.addParameter(&p_m_port);

    //it starts an access point
    //and goes into a blocking loop awaiting configuration
    if (!ESPAsync_wifiManager.startConfigPortal((const char *) ssid.c_str(), password))
      Serial.println("Not connected to WiFi but continuing anyway.");
    else {
      Serial.println("WiFi connected...:)");
    }

    strcpy(m_login, p_m_login.getValue());
    strcpy(m_pass, p_m_pass.getValue());
    strcpy(m_port, p_m_port.getValue());
    // Writing JSON config file to flash for next boot
    writeConfigFile();
    delete webServer_async;
  }

  digitalWrite(PIN_LED, LED_OFF); // Turn led off as we are not in configuration mode.

  startedAt = millis();

  while ( (WiFi.status() != WL_CONNECTED) && (millis() - startedAt < WIFI_CONNECT_TIMEOUT ) )
  { 
    IPAddress ip_255(255,255,255,255);   
    WiFi.disconnect(); // probalbly not needed
    delay(1000);
    WiFi.mode(WIFI_STA);
    //WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE);
    //WiFi.hostname("wifi-mic");
    String hostname = "wifi-mic";
    WiFi.setHostname(hostname.c_str());
    //WiFi.persistent (false);
    // We start by connecting to a WiFi network

    Serial.print("Connecting to ");
    Serial.println(Router_SSID);

    WiFi.begin(Router_SSID.c_str(), Router_Pass.c_str());

    int i = 0;
    while ((!WiFi.status() || WiFi.status() >= WL_DISCONNECTED) && i++ < WHILE_LOOP_STEPS)
    {
      delay(WHILE_LOOP_DELAY);
    }

    if (WiFi.localIP() == ip_255 && WiFi.status() == WL_CONNECTED) {//v.2.00.. get always 255.255.255.255 as IP address from WiFi.localIP()
      WiFi.disconnect();
      delay(1000);
      WiFi.mode(WIFI_STA);
      WiFi.setHostname(hostname.c_str());
      WiFi.config(IPAddress(0, 0, 0, 0), IPAddress(192, 168, 1, 1), IPAddress(255, 255, 255, 0), IPAddress(192, 168, 1, 1));
      WiFi.begin(Router_SSID.c_str(), Router_Pass.c_str()); 
      i = 0;
       while ((!WiFi.status() || WiFi.status() >= WL_DISCONNECTED) && i++ < WHILE_LOOP_STEPS)
      {
        delay(WHILE_LOOP_DELAY);
      }
    }
  }

  Serial.print("After waiting ");
  Serial.print((millis() - startedAt) / 1000);
  Serial.print(" secs more in setup(), connection result is ");

  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print("connected. Local IP: ");
    Serial.println(WiFi.localIP());
    con_flag = true;
    timeClient.begin();
    // GMT +1 = 3600
    // GMT +8 = 28800
    // GMT -1 = -3600
    // GMT 0 = 0
    timeClient.setTimeOffset(3600 * 3); //for GMT+3
    timeClient.update();
    launchWeb(0);
    digitalWrite(PIN_LED, LED_ON);
    delay(500);
    digitalWrite(PIN_LED, LED_OFF);
  }
  else
    Serial.println(ESPAsync_wifiManager.getStatus(WiFi.status()));

#endif
}

//loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop
void loop(void) {
  int32_t value;
  char buff[9];

#ifndef NO_WIFI

  if (con_flag && !stream_active) {
    //server.handleClient();
    if (tme == 0)
    {
      if (!(timeClient.isTimeSet()))
      {
        timeClient.update();
      }
      unsigned long epochTime = timeClient.getEpochTime();
      // Get a time structure
      struct tm *ptm = gmtime((time_t *)&epochTime);
      int monthDay = ptm->tm_mday;
      int currentMonth = ptm->tm_mon + 1;
      int currentYear = ptm->tm_year + 1900;
      sprintf(date_, "%02d/%02d/%04d", monthDay, currentMonth, currentYear);
      // get internal temp of ESP32
      uint8_t temp_farenheit = temprature_sens_read();
      // convert farenheit to celcius
      double temp = (temp_farenheit - 32) / 1.8;
      memset(temp_, 0x30, sizeof temp_);
      sprintf(temp_, "%.4lg", temp);
      // // Print complete date:
      // char str[18];
      // sprintf(str, "%02d/%02d/%04d %02d:%02d  itemp°C:%.4lg\r\n", monthDay,currentMonth,currentYear,timeClient.getHours(),timeClient.getMinutes(),temp);
      // Serial.printf("%s", str);    
      if (WiFi.status() != WL_CONNECTED) {
        Serial.println("NO WIFI, try to connect");
        WiFi.mode(WIFI_STA);
       // WiFi.hostname("wifi-mic");
        WiFi.setHostname("wifi-mic");
        //WiFi.persistent (true);
        //WiFi.setOutputPower(0);
        WiFi.begin(Router_SSID.c_str(), Router_Pass.c_str());
      }
    }
    if (starting){
        char strr[30];
        sprintf(strr, "...starting %s %02d:%02d\r\n", date_, timeClient.getHours(), timeClient.getMinutes());
        log_page = String("<div class='text'><pre>") + String(strr);
        //log_page += String("ESP reset reason - ") + String(reset_reson_str(esp_reset_reason())) + String("\n");
        log_page += String("ESP reset reason rtc - ") + ESP32GetResetReason(0) + String("\n");
        if (strncmp(log_str, "Last client", 11) == 0)  //If the last client caused a restart  ESP32.
          log_page += String(log_str);
        starting = false;
        mutex_wav_stream  = xSemaphoreCreateMutex();
        free_mem8  = heap_caps_get_free_size(MALLOC_CAP_8BIT);
        free_mem32 = heap_caps_get_free_size(MALLOC_CAP_32BIT);
      }
    tme++;
    if (tme > 6000) tme = 0;
    // if (tme > 6000) {
    //    if (timeClient.isTimeSet()) tme = 1;
    //       else tme = 0;
    // }
  }

