vernonet/ESP32_PRJ/esp32_wifi_microphone_async/src/main.cpp
  // is configuration portal requested?
  if (digitalRead(TRIGGER_PIN3) == LOW)
  {
    Serial.println("\nConfiguration portal requested.");
    digitalWrite(PIN_LED, LED_ON); // turn the LED on by making the voltage LOW to tell us we are in configuration mode.

    //Local intialization. Once its business is done, there is no need to keep it around
     ESPAsync_WiFiManager ESPAsync_wifiManager(webServer_async, &dnsServer, "wifi-mic-ap");;


    //Check if there is stored WiFi router/password credentials.
    //If not found, device will remain in configuration mode until switched off via webserver.
    Serial.print("Opening configuration portal. ");
    Router_SSID = ESPAsync_wifiManager.WiFi_SSID();
    if (Router_SSID != "")
    {
      ESPAsync_wifiManager.setConfigPortalTimeout(60); //If no access point name has been previously entered disable timeout.
      Serial.println("Got stored Credentials. Timeout 60s");
    }
    else
      Serial.println("No stored Credentials. No timeout");
    
    ESPAsync_WMParameter p_m_login("mic_login", "mic Login", USER_OTA, 12);  
    ESPAsync_WMParameter p_m_pass("mic_pass", "mic password", PASS_OTA, 12);
    ESPAsync_WMParameter p_m_port("mic_port", "server port", SERVER_PORT, 8);

    ESPAsync_wifiManager.addParameter(&p_m_login);
    ESPAsync_wifiManager.addParameter(&p_m_pass);
    ESPAsync_wifiManager.addParameter(&p_m_port);
    //it starts an access point
    //and goes into a blocking loop awaiting configuration
    if (!ESPAsync_wifiManager.startConfigPortal((const char *) ssid.c_str(), password))
    {
      Serial.println("Not connected to WiFi but continuing anyway.");
    }
    else
    {
      //if you get here you have connected to the WiFi
      Serial.println("connected...yeey :):):)");
    }

    strcpy(m_login, p_m_login.getValue());
    strcpy(m_pass, p_m_pass.getValue());
    strcpy(m_port, p_m_port.getValue());
    // Writing JSON config file to flash for next boot
    writeConfigFile();

    digitalWrite(PIN_LED, LED_OFF); // Turn led off as we are not in configuration mode.
    delete webServer_async;
  }

  // if (stream_active && client_connected)
  // {
  //   // for watchdog timer
  //   // TIMERG0.wdt_wprotect = TIMG_WDT_WKEY_VALUE;
  //   // TIMERG0.wdt_feed = 1;
  //   // TIMERG0.wdt_wprotect = 0;
  //   //digitalWrite(PIN_LED, !digitalRead(PIN_LED)); 
  // }

  if (stream_active && client_->disconnected())
  {
    stream_active = false;
    vTaskSuspend(i2sMemsToBuffTaskHandle);
    Serial.print(" <---> client disconected\r\n");
    char strr[18] = "--/--/---- 00:00";
    if (timeClient.isTimeSet())
    {
      sprintf(strr, "%02d:%02d", timeClient.getHours(), timeClient.getMinutes());
      sprintf((char *)log_str + strlen(log_str) - 2, " <---> %02d:%02d\r\n", timeClient.getHours(), timeClient.getMinutes());
    }
    log_page += String(strr) + String(" client disconected ") + String("\n");
    i2s_stop(I2S_PORT);
    client_ = nullptr;
    digitalWrite(PIN_LED, LED_OFF);
  }
   vTaskDelay(10 / portTICK_PERIOD_MS);
#else

  start_rec = true;
  i2sSampler = new I2SMEMSSampler(I2S_PORT, i2s_mic_pins, i2s_config, false);
  // start sampling from i2s device
  i2sSampler->start();
  // set up the i2s sample writer task
  TaskHandle_t i2sMemsToUartTaskHandle;
  xTaskCreatePinnedToCore(i2sMemsToUartTask, "I2S Writer Task", 4096, i2sSampler, 1, &i2sMemsToUartTaskHandle, 1);
  while (true) {};

#endif

}

void createWebServer(int webtype)
{
  if ( webtype == 1 ) {  //softAP
    //

  } else if (webtype == 0) {  //are configured
    server = new AsyncWebServer(atoi(m_port)); 
    if (MDNS.begin("wifi-mic")) {
      Serial.println("MDNS responder started");
    }
    else {
      Serial.println("Error setting up MDNS responder!");
    }
    MDNS.addService("http", "tcp", atoi(m_port));  //orig 80
    //MDNS.addService("osc", "udp", 4500);
    //MDNS.addService("telnet", "tcp", 23);// Telnet server RemoteDebug

  //ws.onEvent(onWsEvent);
  //server->addHandler(&ws);
  //server->addHandler(&events);  

  server->onNotFound(handleNotFound);
  server->on("/upd_frm", HTTP_GET, handle_upd_frm);//for update frm http://wifi-mic.local:8080/upd_frm     admin:admin
  /*handling uploading firmware file */
  server->on("/update", HTTP_POST, handle_update, handle_upload);
  server->on("/info", HTTP_GET, handle_info);
  server->on("/rec.wav", HTTP_GET, handle_rec_wav);
  server->on("/log", HTTP_GET, handle_log);
  //server->on("/scan", HTTP_GET,handle_scan);
  //server->on("/restart", HTTP_GET,handle_restart);
  }
}


void launchWeb(int webtype) {
  Serial.println("");
  Serial.println("WiFi connected");
  Serial.print("Local IP: ");
  Serial.println(WiFi.localIP());
  Serial.print("SoftAP IP: ");
  Serial.println(WiFi.softAPIP());
  createWebServer(webtype);
  // Start the server
  server->begin();
  Serial.println("Server started");
}


void handleNotFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "404: Not found"); // Send HTTP status 404 (Not Found) when there's no handler for the URI in the request
}

void handle_rec_wav(AsyncWebServerRequest *request) {
  if (strlen(USER_OTA) > 0)
  {
    authenticate = true;
  }
  if (authenticate && !request->authenticate(m_login, m_pass))
    return request->requestAuthentication();

  client_ = request->client();
  if (client_)
  {
    //client_connected = true;
    wav_stream.reset();
    stream_active = true;
    Serial.print("New client conected - IP ");
    Serial.print(client_->remoteIP());
    Serial.printf(" PORT %d", client_->remotePort());
    sprintf(log_str, "Last client IP %s PORT %d ", client_->remoteIP().toString().c_str(), client_->remotePort());
    //Serial.println(log_str);
    char strr[18] = "--/--/---- 00:00";
    if (timeClient.isTimeSet())
    {
      sprintf(strr, "%s %02d:%02d", date_, timeClient.getHours(), timeClient.getMinutes());
      sprintf((char*)log_str + strlen(log_str), "%s %02d:%02d\r\n", date_, timeClient.getHours(), timeClient.getMinutes());
    }
    if (log_page.length() >= (LOG_SIZE - 100))
      log_page = "";
    // if (log_page. length() == 0) log_page = F("<div class='text'><pre>");
    // if (log_page.endsWith("</pre></div>")) log_page.remove(log_page.length()-12, 12);
    if (!(log_page.startsWith("<div class='text'><pre>")))
      log_page = String("<div class='text'><pre>") + log_page;
    log_page.replace("</pre></div>", ""); // delete old "</pre></div>"
    if (!start_rec)
    { //sizeof tcp buff to log
      log_page += String("TCP_buff_size ") + String(client_->space()) + String(" bytes\n");
    }
    log_page += String(strr) + String(" client conected IP ") + client_->remoteIP().toString() + String(" <---> ");
    if (!start_rec)
    { // if first connections
      start_rec = true;
      i2sSampler = new I2SMEMSSampler(I2S_NUM_0, i2s_mic_pins, i2s_config, false);
      // start sampling from i2s device
      i2sSampler->start();
      delay(10);
      // set up the i2s sample writer task
      xTaskCreatePinnedToCore(i2sMemsToBuffTask, "I2S Writer Task", 4096, i2sSampler, 1, &i2sMemsToBuffTaskHandle, 1);
    }
    // if any other connections
    else
    {
      i2s_start(I2S_PORT);
      delay(10);
      vTaskResume(i2sMemsToBuffTaskHandle);
    }

    send_count = 0;
    blk_sze_changed = false;
    aviable = 0;

    memcpy(&temp_buf_f[0], &test_wav[0], 44);
    temp_buf_f[4 / 4] = (SAMPLE_BUFFER_SIZE)*NUM_CPY + 36; // long size
    temp_buf_f[24 / 4] = SAMPLE_RATE;
    temp_buf_f[28 / 4] = SAMPLE_RATE * (BITS_PER_SAMPLE / 8);
    temp_buf_f[32 / 4] = (uint32_t)(BITS_PER_SAMPLE >> 3) + ((BITS_PER_SAMPLE << 16) & 0xFF0000);
    temp_buf_f[40 / 4] = (SAMPLE_BUFFER_SIZE)*NUM_CPY; // long chunkSize

