vernonet/ESP32_PRJ/esp32_wifi_microphone_async/src/main.cpp
    free_mem8 = heap_caps_get_free_size(MALLOC_CAP_8BIT);
    free_mem32 = heap_caps_get_free_size(MALLOC_CAP_32BIT);

    //Serial.println("New response ");
    //Serial.printf("new client -> 0x%x\r\n", request->client());

    // beginChunkedResponse
    AsyncWebServerResponse *response = request->beginResponse("audio/x-wav", 100, [](uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
    
        uint32_t sze, aviable_;
        uint32_t space = client_->space(), client_mss = client_->getMss();
        uint16_t block_size;

        if (xSemaphoreTake(mutex_wav_stream, 3 / portTICK_PERIOD_MS) != pdTRUE)
        {
          Serial.println("RESPONSE_TRY_AGAIN - mutex busy");
          return RESPONSE_TRY_AGAIN;
        }

        aviable = wav_stream.available();
        if (aviable < 4096 || space <= 4096)
        {
          //////aviable = wav_stream.available();
          //Serial.printf("RESPONSE_TRY_AGAIN  aviable %d\r\n", aviable);
          xSemaphoreGive(mutex_wav_stream);
          return RESPONSE_TRY_AGAIN;
        }
        else
        {
          if (!index)
          {
            memcpy(buffer, &temp_buf_f[0], 44);
            sze = 44;
          }
          else
          {
            if (!blk_sze_changed)
            {
              block_size = (space < client_mss * 4) ? SEND_BLOCK_SIZE_MIN : SEND_BLOCK_SIZE_MAX;
              if (block_size < SEND_BLOCK_SIZE_MAX)
                blk_sze_changed = true;
            }
            else
              block_size = SEND_BLOCK_SIZE_MIN;

            
            //Serial.printf("index %d aviable %d bytes heap %d block_size %d mss %d space %d\r\n", index, aviable, heap_caps_get_free_size(MALLOC_CAP_8BIT), block_size, client_mss, space);
            sze = wav_stream.readBytes(buffer, block_size);
            //////aviable -= sze;
          }
          xSemaphoreGive(mutex_wav_stream);
        }
     
     return sze; });

    response->setContentLength(SAMPLE_BUFFER_SIZE * (BITS_PER_SAMPLE / 8) * NUM_CPY + 44);
    request->send(response);
  }
}

void handle_upd_frm(AsyncWebServerRequest *request)
{ 
    if (strlen(m_login) > 0) {
      authenticate = true;
    }

    if(authenticate && !request->authenticate(m_login, m_pass))
        return request->requestAuthentication();   

    request->send(200, "text/html", serverIndex);
}

void handle_update(AsyncWebServerRequest *request)
{
    shouldReboot = !Update.hasError();
    AsyncWebServerResponse *response = request->beginResponse(200, "text/plain", shouldReboot?"OK":"FAIL");
    response->addHeader("Connection", "close");
    request->send(response);
    delay(100);
    ESP.restart();
}
  
void handle_upload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final){
    if(!index){
      Serial.printf("Update Start: %s\n", filename.c_str());
      //Update.begin(true);
      if(!Update.begin(UPDATE_SIZE_UNKNOWN)){
        Update.printError(Serial);
      }
    }
    if(!Update.hasError()){
      if(Update.write(data, len) != len){
        Update.printError(Serial);
      }
    }
    if(final){
      if(Update.end(true)){
        Serial.printf("Update Success: %uB\n", index+len);
      } else {
        Update.printError(Serial);
      }
    }
  
}

 void handle_info(AsyncWebServerRequest *request) 
{
    if (strlen(m_login) > 0) {
      authenticate = true;
     }
    if(authenticate && !request->authenticate(m_login, m_pass))
        return request->requestAuthentication();   

    
    // http://wifi-mic.local:8080/info
    String page = F("<html><head><meta http-equiv='content-type' content='text/html; charset=utf-8'></head><body>\n");
    page += F(WM_HTTP_STYLE);
    page += F("</head><body><div class='container'><div style='text-align:left;display:inline-block;min-width:260px;'>");
    page += F("<h2>wifi-mic information</h2>");
    page += F("<fieldset>");
    page += F("<h3>Device Data</h3>");
    page += F("<table class=\"table\">");
    page += F("<thead><tr><th>Name</th><th>Value</th></tr></thead><tbody>");

    param_info(page, "ESP32 core version    ", String(ESP_ARDUINO_VERSION_MAJOR) + "." + String(ESP_ARDUINO_VERSION_MINOR) + "." + String(ESP_ARDUINO_VERSION_PATCH)); 
    param_info(page, "Compil. date of  FW ", String(compile_date));    
    param_info(page, "Flash Chip Size ", (ESP.getFlashChipSize()/1024) + String(" kbytes"));
    param_info(page, "Access Point IP ", (WiFi.softAPIP().toString()));   
    param_info(page, "Access Point MAC", WiFi.softAPmacAddress()); 
    param_info(page, "SSID", Router_SSID);   
    param_info(page, "Station IP", WiFi.localIP().toString());  
    param_info(page, "Station MAC", WiFi.macAddress());  
    param_info(page, "Core temp", String(temp_) + String(" °C"));  
    param_info(page, "CpuFreq", String(ESP.getCpuFreqMHz()) + String(" MHz"));  
    param_info(page, "Free mem8/32bit", String(free_mem8/1024) + "/" + String(free_mem32/1024) + String(" Kbytes"));  
    //param_info(page, "Free mem8/32bit", free_mem32/1024 + String(" Kbytes"));
   
    page += F("</tbody></table>");
    page += F("</fieldset>");
    page += F("<a href='/log'>View log("); 
    page += String(log_page.length());
    page += F(" bytes)</a>");
    page += FPSTR(WM_HTTP_END);

    AsyncWebServerResponse *response = request->beginResponse(200, "text/html", (const char *) page.c_str());
    response->addHeader("Connection", "close");
    request->send(response);
}

void handle_log(AsyncWebServerRequest *request) 
{
    if (strlen(m_login) > 0) {
      authenticate = true;
     }
   
    if(authenticate && !request->authenticate(m_login, m_pass))
        return request->requestAuthentication();   

    log_page += F("</pre></div>"); 
    AsyncWebServerResponse *response = request->beginResponse(200, "text/html", (const char *) log_page.c_str());
    response->addHeader("Connection", "close");
    request->send(response);
}

void handle_scan(AsyncWebServerRequest *request)
{
  if (strlen(m_login) > 0)
  {
    authenticate = true;
  }

  if (authenticate && !request->authenticate(m_login, m_pass))
    return request->requestAuthentication();

  {
    String json = "[";
    int n = WiFi.scanComplete();
    if (n == -2)
    {
      WiFi.scanNetworks(true, true);
    }
    else if (n)
    {
      for (int i = 0; i < n; ++i)
      {
        if (i)
          json += ",";
        json += "{";
        json += "\"rssi\":" + String(WiFi.RSSI(i));
        json += ",\"ssid\":\"" + WiFi.SSID(i) + "\"";
        json += ",\"bssid\":\"" + WiFi.BSSIDstr(i) + "\"";
        json += ",\"channel\":" + String(WiFi.channel(i));
        json += ",\"secure\":" + String(WiFi.encryptionType(i));
        //json += ",\"hidden\":" + String(WiFi.isHidden(i) ? "true" : "false");
        json += "}";
      }
      WiFi.scanDelete();
      if (WiFi.scanComplete() == -2)
      {
        WiFi.scanNetworks(true);
      }
    }
    json += "]";
    request->send(200, "application/json", json);
    json = String();
  }
}

void handle_restart(AsyncWebServerRequest *request)
{
  if (strlen(m_login) > 0)
  {
    authenticate = true;
  }
  if (authenticate && !request->authenticate(m_login, m_pass))
    return request->requestAuthentication();

  request->send(200, "text", "ESP32 restarting...");
  delay(100);
  ESP.restart();
}

// Task to write samples into stream
void i2sMemsToBuffTask(void *param)
{
  I2SSampler *sampler = (I2SSampler *)param;
  uint32_t sze;
  int samples_read;

  while (true)
  {
    //  TIMERG0.wdt_wprotect = TIMG_WDT_WKEY_VALUE;
    //  TIMERG0.wdt_feed = 1;
    //  TIMERG0.wdt_wprotect = 0;

