vernonet/ESP32_PRJ/esp32_wifi_microphone_async/src/main.cpp
    samples_read = sampler->read(samples, SAMPLE_BUFFER_SIZE * 4, BITS_PER_SAMPLE);
    while (xSemaphoreTake(mutex_wav_stream, portMAX_DELAY) != pdTRUE)
    {
      vTaskDelay(5 / portTICK_PERIOD_MS);
    }
    // Serial.print("Start read samples ->");
    if (samples_read) {
      wav_stream.write((uint8_t *)samples, samples_read * (BITS_PER_SAMPLE / 8));
    }  
    // Serial.println(" Stop read samples");
    xSemaphoreGive(mutex_wav_stream);
    digitalWrite(PIN_LED, !digitalRead(PIN_LED)); // indicate process
    //delay ms 120 for SAMPLE_RATE 16000, 90 for SAMPLE_RATE 22050, 59 for SAMPLE_RATE 33000
    vTaskDelay(((SAMPLE_BUFFER_SIZE*4*1000)/SAMPLE_RATE - 3) / portTICK_PERIOD_MS);  
  }
}

// Task to send samples to uart
void i2sMemsToUartTask(void *param)
{
  I2SSampler *sampler = (I2SSampler *)param;

  while (true)
  {
     int samples_read = sampler->read(samples, SAMPLE_BUFFER_SIZE, BITS_PER_SAMPLE);
     Serial.write((char *)samples,  samples_read * (BITS_PER_SAMPLE/8));
     digitalWrite(PIN_LED, !digitalRead(PIN_LED)); 
  }
}

bool writeConfigFile()
{
  Serial.println("Saving config file");

#if (ARDUINOJSON_VERSION_MAJOR >= 6)
  DynamicJsonDocument json(1024);
#else
  DynamicJsonBuffer jsonBuffer;
  JsonObject& json = jsonBuffer.createObject();
#endif

  // JSONify local configuration parameters
  json["mic_login"] = m_login;
  json["mic_pass"]  = m_pass;
  json["mic_port"]  = m_port;
 

  // Open file for writing
  File f = FileFS.open(CONFIG_FILE, "w");

  if (!f)
  {
    Serial.println("Failed to open config file for writing");
    return false;
  }

#if (ARDUINOJSON_VERSION_MAJOR >= 6)
  serializeJsonPretty(json, Serial);
  // Write data to file and close it
  serializeJson(json, f);
#else
  json.prettyPrintTo(Serial);
  // Write data to file and close it
  json.printTo(f);
#endif

  f.close();

  Serial.println("\nConfig file was successfully saved");
  return true;
}

bool readConfigFile(void)
{
  // this opens the config file in read-mode
  File f = FileFS.open(CONFIG_FILE, "r");

  if (!f)
  {
    Serial.println("Configuration file not found");
    return false;
  }
  else
  {
    // we could open the file
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size + 1]);

    // Read and store file contents in buf
    f.readBytes(buf.get(), size);
    // Closing file
    f.close();
    // Using dynamic JSON buffer which is not the recommended memory model, but anyway
    // See https://github.com/bblanchon/ArduinoJson/wiki/Memory%20model

#if (ARDUINOJSON_VERSION_MAJOR >= 6)
    DynamicJsonDocument json(1024);
    auto deserializeError = deserializeJson(json, buf.get());
    if ( deserializeError )
    {
      Serial.println("JSON parseObject() failed");
      return false;
    }
    serializeJson(json, Serial);
#else
    DynamicJsonBuffer jsonBuffer;
    // Parse JSON string
    JsonObject& json = jsonBuffer.parseObject(buf.get());
    // Test if parsing succeeds.
    if (!json.success())
    {
      Serial.println("JSON parseObject() failed");
      return false;
    }
    json.printTo(Serial);
#endif

    // Parse all config file parameters, override
    // local config variables with parsed values
    if (json.containsKey("mic_login"))
    {
      strcpy(m_login, json["mic_login"]);
    }

    if (json.containsKey("mic_pass"))
    {
      strcpy(m_pass, json["mic_pass"]);
    }

    if (json.containsKey("mic_port"))
    {
      strcpy(m_port, json["mic_port"]);
    }
  }
  Serial.println("\nConfig file was successfully parsed");
  return true;
}


//return true - ok, false - error
bool mount_fs(void) {

  if (!FileFS.begin(true)) {


    Serial.println(F("LittleFS failed! Already tried formatting."));
  
    if (!FileFS.begin())
    {     
      // prevents debug info from the library to hide err message.
      delay(100);
      
      Serial.println(F("LittleFS failed!. Please use SPIFFS or EEPROM. Stay forever"));

      return false;
    }
    
  }
   else {
     Serial.println(F("LittleFS mount OK!"));
     return true;
   }
  return true;
}

const char * reset_reson_str(esp_reset_reason_t val)
{

    switch (val)
    {
    case ESP_RST_UNKNOWN:   return "UNKNOWN";
    case ESP_RST_POWERON:   return "POWERON";
    case ESP_RST_EXT:       return "EXT";
    case ESP_RST_SW:        return "SW";
    case ESP_RST_PANIC:     return "PANIC";
    case ESP_RST_INT_WDT:   return "INT_WDT";
    case ESP_RST_TASK_WDT:  return "TASK_WDT";
    case ESP_RST_WDT:       return "WDT";
    case ESP_RST_DEEPSLEEP: return "DEEPSLEEP";
    case ESP_RST_BROWNOUT:  return "BROWNOUT";
    case ESP_RST_SDIO:      return "SDIO";
    default:
        return "Unknown esp_reset_reason_t";
    }
}

String ESP32GetResetReason(uint32_t cpu_no) {
	
  switch (rtc_get_reset_reason(cpu_no)) {
    case POWERON_RESET          : return F("Vbat power on reset");                              // 1
    case SW_RESET               : return F("Software reset digital core");                      // 3
    case OWDT_RESET             : return F("Legacy watch dog reset digital core");              // 4
    case DEEPSLEEP_RESET        : return F("Deep Sleep reset digital core");                    // 5
    case SDIO_RESET             : return F("Reset by SLC module, reset digital core");          // 6
    case TG0WDT_SYS_RESET       : return F("Timer Group0 Watch dog reset digital core");        // 7
    case TG1WDT_SYS_RESET       : return F("Timer Group1 Watch dog reset digital core");        // 8
    case RTCWDT_SYS_RESET       : return F("RTC Watch dog Reset digital core");                 // 9
    case INTRUSION_RESET        : return F("Instrusion tested to reset CPU");                   // 10
    case TGWDT_CPU_RESET        : return F("Time Group reset CPU");                             // 11
    case SW_CPU_RESET           : return F("Software reset CPU");                               // 12
    case RTCWDT_CPU_RESET       : return F("RTC Watch dog Reset CPU");                          // 13
    case EXT_CPU_RESET          : return F("or APP CPU, reseted by PRO CPU");                   // 14
    case RTCWDT_BROWN_OUT_RESET : return F("Reset when the vdd voltage is not stable");         // 15
    case RTCWDT_RTC_RESET       : return F("RTC Watch dog reset digital core and rtc module");  // 16            
  }
  return F("NO_MEAN");                                                                          // 0 and undefined
}
